[
    {
        "id": 1,
        "title": "Booki",
        "description": "Projet OpenclassRooms : Projet d'intégration d'une page d'accueil pour une agence de voyage.",
        "image": "Images/Booki.webp",
        "link": "http://82.65.65.171/Booki/",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "Booki est le premier projet réalisé lors de ma formation de développeur web. Il est entièrement réalisé en HTML et CSS.",
            "titleValid" : "<strong>Pour être validé :</strong><br>",
            "contentValid": "Ce projet ne devait utiliser aucun framework de type Bootstrap, ni de cms de type Wordpress. La page devait être responsive sur les écrans de pc, tablettes et smartphones. Le code HTML devait respecter la sémentique et être validé par <a href='https://validator.w3.org/' target='_blank'>W3C validator</a>",
            "titleComp" : "<strong>Compétences acquises :</strong><br>",
            "contentComp": "<ul><li>Intégrer du contenu conformément à une maquette avec HTML et CSS</li><li>Implémenter une interface responsive avec HTML et CSS</li></ul>",
            "encounteredTitle": "",
            "encounteredContent": "",
            "linkSource": "https://github.com/Cyril-hub-76/Booki",
            "linkText": "Lien Github"
        }
    },
    {
        "id": 2,
        "title": "Player",
        "description": "Lecteur de musique en ligne exploitant une base de données Sql.",
        "image": "Images/G-key.webp",
        "link": "http://82.65.65.171/playitFree/",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "Ce projet est en développement. C'est le premier projet sur lequel j'interviens tant sur le backend que sur le frontend que sur la mise en place du serveur. <br><strong>Côté Php =></strong> Les fonctions principales sont la création d'un compte et la connexion.<br><strong>Côté Sql =></strong> La base de données possède deux tables, une pour les utilisateurs, l'autre pour représenter un album.<br><strong>Côté Javascript =></strong> on récupère les données de chaque album comme le nom de l'album, le nom du fichier de la pochette, l'artiste etc et de créer avec Javascript les balises HTML qui contiennent ces informations comme la source de l'audio ou de l'image. Puis créer les fonctions de lecture, d'affichage de la durée de la musique ou de gestion du volume. <br><strong>Côter serveur LAMP =></strong> Raspberry Pi.3 => Linux + Apache + MySql + Php",
            "titleValid" : "",
            "contentValid": "",
            "titleComp" : "<strong>Compétences acquises :</strong><br>",
            "contentComp": "<ul><li>Installer un système Linux</li><li>Administrer un système Linux avec ssh</li><li>Installer et configurer un serveur Apache</li><li>Confidurer MariaDb et créer une base de données</li><li>Php : Vérifier et sécuriser les données envoyées par l'utilisateur depuis les formulaires.</li><li>Sql : Protéger les requêtes des injections Sql</li><li>Passer les données depuis le backend vers le frontend</li></ul>",
            "encounteredTitle": "<strong>Difficultés rencontrées :</strong><br>",
            "encounteredContent": "La principale problématique rencontrée à été d'envoyer les données depuis la base vers le frontend et de les récupérer. Pour cela, il a fallu encoder les données au format json depuis le backend ( json_encode ) et les récupérer avec dans cet exemple XMLHttpRequest.",
            "linkSource": "http://82.65.65.171/playitFree/player.php",
            "linkText": "Voir le projet"
        }
    },
    {
        "id": 3,
        "title": "AMSAC-ASEF",
        "description": "Reproduction du site web de l' AMSAC-ASEF de Pavilly en 2020. Révision du code en 2022 pour le rendre responsive.",
        "image": "Images/amsac.webp",
        "link": "http://82.65.65.171/amsac/index.php",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "C'est l'un de mes premiers projets. J'ai commencé par faire la page d'accueil de ce site en m'appuyant sur mes connaissances acquises grâce au cours <a href='https://openclassrooms.com/fr/courses/1603881-creez-votre-site-web-avec-html5-et-css3' target='_blank'>\"Créez votre site web avec HTMLS et CSS3\"</a> jusqu'à terminer toutes les pages. J'ai poursuivi en y intégrant le carrousel. Je suis revenue sur le projet pour travailler le responsive et y ajouter un menu burger." ,
            "titleValid" : "",
            "contentValid": "",
            "titleComp" : "<strong>Compétences acquises :</strong><br>",
            "contentComp": "<ul><li>Reproduire un site web et sa charte graphique</li><li>Implémenter une interface responsive avec HTML + CSS + javascript</li><li>Implémenter une animation de défilement d'images avec les keyframes</li></ul>",
            "encounteredTitle": "<strong>Difficultés rencontrées :</strong><br>",
            "encounteredContent": "Les difficultés que j'ai rencontrées: Transformer un site à taille fixe en un site responsive. Il a donc fallu revoir certaines parties du code HTML, anticiper l'apparence des pages au format mobile. <br>Une autre problématique à été l'application des keyframes pour créer ce défilement. Il a fallu comprendre sa logique et faire des <a href='Documents/timimg_carrousel.pdf' target='_blank'>schémas</a>",
            "linkSource": "http://82.65.65.171/amsac/style.css",
            "linkText": "Voir le projet"
        }
    },
    {
        "id": 4,
        "title": "Ingouville sur mer",
        "description": "Intégration de la page d'accueil du site web de la mairie d'Ingouville sur Mer lors d'un stage en observation.",
        "image": "Images/ingouville.webp",
        "link": "https://www.ingouville.fr/",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "À l'issue d'une formation de technique de recherche d'emploi faite en 2020, j'ai fais un stage d'observation en développement web à l'imprimerie <a href='https://www.ic4.fr/' target='_blank'>Ic4</a> à Dieppe. Une première phase de ce stage à été l'observation, les questions sur les languages utilisés, la prise de notes et une deuxième phase d'exécution pendant laquelle j'ai pu écrire la structure HTML et le CSS de la page d'acceuil du site web de la maire D'ingouville-sur-Mer d'après une maquette.",
            "titleValid" : "",
            "contentValid": "",
            "titleComp" : "<strong>Compétences acquises :</strong><br>",
            "contentComp": "<ul><li>Le perfectionnement en CSS</li><li>Faire preuve de rigueur</li></ul>",
            "encounteredTitle": "<strong>Difficultés rencontrées :</strong><br>",
            "encounteredContent": "Les problématiques rencontrées on été de respecter la charte graphique le plus fidèlement possible, d'organiser le CSS correctement pour qu'il soit maintenable, trouver les solutions pour respecter le graphisme comme l'utilisation de pseudo-classes. Pour les surmonter, j'ai bien entendu appliqué les conseils de Clément, mon maître de stage et surtout consulté les forums comme stack overflow et la documentation MDN.",
            "linkSource": "https://www.ingouville.fr/",
            "linkText": "Voir le site"
        }
    },
    {
        "id": 5,
        "title": "Côté linux",
        "description": "Quelques scripts programmés en bash sous forme d'un mini blog.",
        "image": "Images/linux_logo.webp",
        "link": "http://82.65.65.171/coteLinux/",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "Cette page raconte les prémices de ma vie de développeur, avant même que je ne décide de me lancer dans cette aventure. <br>J'y ai mis quelques scripts fun pour pimper mon environnment de bureau Gnome. Bonne lecture!!!",
            "titleValid" : "",
            "contentValid": "",
            "titleComp" : "",
            "contentComp": "",
            "encounteredTitle": "",
            "encounteredContent": "",
            "linkSource": "http://82.65.65.171/coteLinux/",
            "linkText": "Voir la page"
        }
    },
    {
        "id": 6,
        "title": "Nina Carducci",
        "description": "Projet d'optimisation de performances, d'accesssibilié et de référencement SEO.",
        "image": "Images/Nina.webp",
        "link": "https://cyril-hub-76.github.io/NinaCarducci/",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "C'est le 5ème projet de ma formation de développeur web. Les performances du site web de la photographe Nina Carducci, l'accessibilité, le référencement naturel sont à améliorer. ( Photos non optimisées, structure HTML à revoir... )",
            "titleValid" : "<strong>Pour être validé :</strong><br>",
            "contentValid": "Il faut: <br>- Un projet 100 % fonctionnel sans bug dans son exécution.<br>- Avoir ajouté le référencement local.<br>- Avoir résolu un des bugs dans le site.<br>- Avoir corrigé l'accessibilité.<br>- Un rapport Lighthouse au vert (note supérieure ou égale à 90 %) sur les 3 axes (performances, accessibilité, SEO).<br>- Avoir un rapport d’intervention complet incluant le cahier de recette.",
            "titleComp" : "<strong>Compétences acquises :</strong><br>",
            "contentComp": "<ul><li>Optimiser les performances d’un site web</li><li>Débugger un site web grâce aux Chrome DevTools</li><li>Rédiger un cahier de recette pour tester un site</li></ul>",
            "encounteredTitle": "<strong>Difficultés rencontrées :</strong><br>",
            "encounteredContent": "Je n'ai pas eu de réelles difficultés techniques. Le projet a surtout nécessité de la documentation pour comprendre les \"erreurs\" remontées par les outils d'audit. Une difficulté tout de même, a été d'expliquer à l'orale comme lors de la rédaction de l'audit, les raisons pour lesquelles certaines des fonctionnalités buggent ou les actions effectuées pour le SEO sans être trop complexe.",
            "linkSource": "https://github.com/Cyril-hub-76/NinaCarducci",
            "linkText": "Lien Github"
        }
    },
    {
        "id": 7,
    	"title": "Kasa",
    	"description": "Projet réalisé lors de ma formation Openclassrooms. Application web React d'une ageance de location immobilière",
    	"image": "Images/kasa.webp",
    	"link": "https://kasa-ih1ac30mc-cyril-hub-76s-projects.vercel.app/",
        "details": {
            "titleDetails" : "<strong>Détails :</strong><br>",
            "contentDetails" : "C'est le 6ème projet effectué lors de ma formation sur Openclassrooms. <br>Ce projet à pour but de créer toutes les composantes de l'interface de l'application d'une entreprise de location d’appartements avec le framework React en s'appuyant sur une maquette figma pour le design.",
            "titleValid" : "<strong>Pour être validé :</strong><br>",
            "contentValid": "Pour être validé, ce projet doit respecter les contraintes techniques du <a href='Documents/Kasa_coding_guidelines.pdf' target='_blank'>coding guidelines</a>",
            "titleComp" : "<strong>Compétences acquises :</strong><br>",
            "contentComp": "<ul><li>Configurer la navigation entre les pages de l'application avec React Router</li><li>Initialiser une application avec Create React App</li><li>Développer des éléments de l'interface d'un site web grâce à des composants React</li></ul>",
            "encounteredTitle": "Difficultés rencontrées :",
            "encounteredContent": "- Isoler les composants réutilisables, il a fallu pour cela repérer dans la maquette qui a été fournie, les éléments identiques présents sur chacune des pages, avec leur comportements. Un exemple, les collapsibles (menu déroulant ). Comme, il n'est pas permis dans ce projet d'utiliser des plugins React, un bonne connaîssance en CSS est primordiale et visionner plusieurs exemples de code <a href='https://www.w3schools.com/howto/howto_js_collapsible.asp' target='_blank'>comme celui-çi</a>. <br>- Bien comprendre le sens parent => enfant. Avec un peu de pratique et de documentation 😉... <br>- Création d'un carrousel. Dans cet exemple, il faut maîtriser à la fois les états, les évènements et avoir des connaissances de bases sur les tableaux. <br><a href='https://dev.to/ziratsu/build-a-slider-with-react-4651' target='_blank'>Ce tutoriel</a> m'a bien aidé dans ma réalisation notament sur la gestion du retour à la première image ou à la dernière selon la position dans le visionnage",
            "linkSource": "https://github.com/Cyril-hub-76/kasa",
            "linkText": "Lien Github"
        }
    }
]